DO/Scenario 1.8/DO_13_Get_DO_Detail_By_ID.yaml
# "https://moonlay-api.dbo.dev/delivery-orders/${csvData[i].do_detail_id}/details/${csvData[i].id}"

config:
  target: "https://moonlay-api.dbo.dev"
  phases:
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
    - duration: 1
      arrivalRate: 220
    - duration: 9
      arrivalRate: 20
scenarios:
  - flow:
      - get: 
          url: "/order-srv/delivery-orders/751592/details/2077013"
          headers:
            Authorization: "Basic ZGJvLW9yZGVyLXNydjpkYm8tb3JkZXItc3J2LXBhc3N3ZA=="